concepts = [{
"uid": 0,
"concept_name": "structure-mapping engine",
"alternative_names": ["SME"],
"concept_definition": "Mental process of finding an alignment of two objects' structures",
"characteristics": [{"description": "", "supporting_papers": [uid,...]}, ...]
"early_key_papers": [uid, ...],
"key_summative_papers_or_books": [uid, ...],
"key_authors": ["Gentner"],
"source_field": "Psychology",
"supporting_theories": [0]
},
{
"uid": 1,
"concept_name": "Representation",
"alternative_names": [],
"concept_definition": "The entity types and relationships between them with which an object can be parsed. [See analogy and abstraction to iterate on this]",
"characteristics": []
"early_key_papers": [uid, ...],
"key_summative_papers_or_books": [uid, ...],
"key_authors": [],
"source_field": "Psychology",
"supporting_theories": [0,1],
"descriptions": [{"quote":"Material structure can have many kinds of relations with conceptual structure. One of the most common is the relationship of representation. All of language depends on this sort of relationship so this one comes easily to mind for linguists. Spoken or written structure in the world represents conceptual entities. This immediately opens the door to the field of semiotics and the huge literature on representations.", "source":1}]
},
{"uid":2,
  "concept_name":"conceptual model",
  "source": 1},
  {"uid":3,
    "concept_name":"conceptual structure",
    "source": 1},
    {"uid":4,
      "concept_name":"material structure",
      "source": 1,
    "theory": 1},
      {"uid":5,
        "concept_name":"mental structure",
        "source": 1,
      "theory": 1},
        {"uid":5,
          "concept_name":"material anchor",
          "definition": "I call an input space from which material structure is projected into a blend a ‘material anchor’ for the blend. The term material anchor is meant to emphasize the stabilizing role of the material structure.",
          "source": 1},
          {"uid":6,
            "concept_name":"conceptual blend[ing]",
            "descriptions": {"quote": "A conceptual blend operates in two input mental spaces to yield a third space, the blend. Partial structure from the input spaces is projected into the blended space, which has emergent structure of its own. ...", "source": 2},
            "source": [1,2],
          "theory",1},
            {"uid":7,
              "concept_name":"blend",
              "source": 1,
            "theory",1},
            {"uid": 8,
            "concept_name": "Thinking processes",
          "source": 1},
          {"uid": 9,
            "name": "representation stability",
        "source": 1},
        {"uid":10,
        "name": "cultural model",
      "quote": "Because they are shared, cultural models tend to be supported and reinforced by the behavior and thinking of others. Cultural models are also systematic in the sense that they exist in a complex nexus of models that mutually constrain one another. Most cultural models are closely related to many other models. This inter-linking contributes to the conservatism of cultural beliefs over time and to the stability of cultural models as resources for individual and group reasoning processes.",
    "source": 1},
    {"uid":11,
    "name": "substrate",
  "source": 3,
"theory": 3,
"description": [{"quote": "In order to combine power and simplicity, we introduce Substrates, which act as 'places for interaction' where users can manipulate objects of interest in a principled and predictable way. Substrates structure and contain data, enforce user-defned constraints among objects and manage dependencies with other substrates. Users can 'tune' and 'tweak' these relationships, 'curry' specialized tools or abstract relationships into interactive templates.", "source": 3}]}
]
