evidence = [
  {
    "uid": 0,
    "paper_source": 1,
    "characteristics_present_with_literal_feature": [...
    ],
    "principles_fulfilled": [...
    ],
    "study_context": "",
    "relevant_results": []
  },
  {
    "uid": 1,
    "artifact_uid": [
      5,
      6
    ],
    "theory_instantiated": 0,
    "concept_instantiated": 0,
    "Theory_and_theory_informed_predictions": [
      {
        "text": "The theory predicts that humans first attend to literal component-value similarities in a 'free-for-all' (irrespective of structure).",
        "Source": "TBD"
      },
      "The rendering of objects can manipulate literal similarity of components' values across objects, e.g., rendering the same word in two different paragraphs in the same color, affecting the order in which local identity matches are perceived or whether they are ultimately perceived at all",
      "The SME that theory predicts is in human's minds (internal SME) may accept the representation and mapping that the external SME computed.",
      "The external SME might help people—more quickly and/or more thoroughly and/or with less cognitive effort—(0) see options in terms of the representation the SME uses as the basis of alignment (1) compare options (2) filter/select options (3) compose through recombination of representation component values.",
      "The external SME might harm your ability to see alignments based on a representation that the external SME is not using."
    ],
    "evidence_of_concept_operating_as_predicted_by_theory": [],
    "evidence_of_concept_NOT_operating_as_predicted_by_theory": [
      {
        "quote": "There were no significant differences between the interface conditions for  either [task] for how successful they were at the task (how  likely they were to send the email) nor how long they took. This  suggests that the exploratory features did not obviously impact  participants' ability to do the task.... When  asked which of the two interfaces was easier and which was more  overwhelming, there was no clear preference; participants varied  in which interface they preferred.",
        "source": 11,
        "section": "5.6.1",
        "author_explanation": "perhaps because the task was easy enough to achieve near perfection in both interfaces",
        "Our_explanation": [
          "Performance and subjective experience with SME assistance for comparison, filtering, selection, recombination tasks might not be measurably different across just nine options for a low-stakes task.",
          "The results aren't the opposite of what was theory predicted; it's simply neutral."
        ],
        "Study_context": "The artifact was accessible in one interface but not the other (the baseline). The baseline was a linear list of responses with no post-hoc analysis or highlighting. Only 9 LLM responses were shown in each interface."
      }
    ]
  },
  {
    "uid": 1,
    "artifact_uid": [
      6,
      7
    ],
    "theory_instantiated": 0,
    "concept_instantiated": 19,
    "Theory_and_theory_informed_predictions": "[FILL IN FROM CRASH COURSE OVERLEAF 1.7.3]",
    "evidence_of_concept_operating_as_predicted_by_theory": [
      {
        "Quote": "Some participants appreciated being able to see all responses at once: 'I think that's what's nice about the grid; [the emails] are all right there. And so your eyes can sort of flutter and dart around as you're reading each one' (P9).",
        "Source": 11,
        "Section": "5.6.2"
      },
      {
        "quote": "These participants also noted that, in the baseline interface, needing to scroll to revisit responses was challenging because 'if you want to reference the first email that you read versus the ninth, you have to scroll up and then you lose the view of the ninth one' (P9).",
        "source": 11,
        "Section": "5.6.2"
      }
    ]
  },
  {
    "uid": 2,
    "artifact_uid": [
      2,
      5,
      6
    ],
    "theory_instantiated": 0,
    "concept_instantiated": [
      0,
      19
    ],
    "Theory_and_theory_informed_predictions": [
      "An external SME will make comparison easier."
    ],
    "evidence_of_concept_operating_as_predicted_by_theory": [
      {
        "quote": "Some participants appreciated how the highlighting features allowed them to easily compare segments of responses (using PDC in the Grid Layout)....",
        "source": 11,
        "section": "5.6.2"
      }
    ]
  },
  {
    "uid": 3,
    "artifact_uid": [
      6,
      7
    ],
    "theory_instantiated": 0,
    "concept_instantiated": 20,
    "Theory_and_theory_informed_predictions": [
      "Concept 20 will make mental filtering easier."
    ],
    "evidence_of_concept_operating_as_predicted_by_theory": [
      {
        "quote": "Some participants appreciated how the highlighting features allowed them to easily ... identify stylistic choices that matched their own style (using the Unique Words feature).",
        "source": 11,
        "section": "5.6.2",
        "our_explanation": [
          "The more local identity matches are not filtered out in step 2 of figure 4-1 (especially relative to the numer that are), the more helpful concept 20 will be."
        ]
      }
    ]
  },
  {
    "uid": 3,
    "artifact_uid": [
      2,
      3,
      5,
      6,
      7
    ],
    "theory_instantiated": 0,
    "concept_instantiated": [
      0,
      19,
      20
    ],
    "Theory_and_theory_informed_predictions": [
      {
        "quote": "[T]he grid layout should help users compare more LLM responses because the spatial arrangement assists their memory.",
        "source": 11
      }
    ],
    "evidence_of_concept_NOT_operating_as_predicted_by_theory": [
      {
        "quote": "[O]ther participants said that the exploratory interface felt overwhelming because seeing all nine at a time 'was too much information. ... The [baseline linear view] was more organized' (P1).",
        "source": 11,
        "section": "5.6.2"
      }
    ],
    "author_explanation": "Participant responses to the two interface conditions seemed to be influenced by their information processing style, something we saw come up in the case studies as well...."
  },
  {
    "uid": 4,
    "source": 12,
    "principle_instantiated": 6,
    "evidence_of_principle_working_as_expected": {
      "quote": "In four experiments, this direct alignment led to faster and more accurate comparison than other placements of the same patterns.",
      "source": 12
    },
    "affected_task": 2
  },
  {
    "uid": 5,
    "source": 12,
    "principle_instantiated": 7,
    "affected_task": 3,
    "evidence_of_principle_working_as_expected": {
      "quote": "A particularly powerful way to gain insight into relational structure is to compare visual representations (Alfieri, NokesMalach, & Schunn, 2013; Gentner & Namy, 1999; Kurtz & Gentner, 2013; Rau, 2017). For example, people who compare simultaneously presented visual examples of heat-flow are more likely to notice the common phenomena than are those who describe the visuals separately, suggesting that comparison highlights commonalities (Kurtz, Miao, & Gentner, 2001). Visual comparison can also highlight differences (Gentner et al., 2016; Sagi, Gentner, & Lovett, 2012). For example, medical students who compared X-rays of diseased lungs with those of healthy lungs were subsequently better able to identify focal lung diseases in further X-rays (Kok, de Bruin, Robben, & van Merriënboer, 2013).",
      "source": 12
    }
  },
  {
    "uid": 6,
    "source": 12,
    "principle_instantiated": 8,
    "affected_task": 2,
    "evidence_of_principle_working_as_expected": {
      "quote": "Though humans can detect changes in sequentially presented visuals, comparison of simultaneously presented visuals allows learners to more fluently encode and compare images (e.g., Christie & Gentner, 2010; Larsen, McIlhagga, & Bundesen, 1999). Simultaneous presentation likely minimizes the impact of working memory limitations that impede comparison across sequentially presented displays (Hyun, Woodman, Vogel, Hollingworth, & Luck, 2009). An advantage of simultaneous visual presentation over sequential presentation for learning has been found for a variety of educational domains (e.g., Brooks, Norman, & Allen, 1991; Gadgil, Nokes-Malach, & Chi, 2012; Jee et al., 2014; Kellman, 2013; Matlen, Vosniadou, Jee, & Ptouchkina, 2011; Rittle-Johnson & Star, 2007).",
      "source": 12
    }
  },
  {
    "uid": 7,
    "relevant_concept": 40,
    "evidence_of_concept_operating_as_predicted_by_theory": {
      "quote": "This process has been studied as a process of analogical comparison—an alignment of common relational structure (Gattis, 2002; Yuan, Uttal, & Gentner, 2017).",
      "source": 12
    },
    "affected_task": 2,
    "theory_instantiated": 0,
  },
  {
    "uid": 8,
    "relevant_concept": 15,
    "evidence_of_concept_operating_as_predicted_by_theory": {
      "quote": "During comparisons, people implicitly seek a one-to-one mapping in which like relations are put into correspondence (Doumas, Hummel, & Sandhofer, 2008; Gentner, 1983, 2010; Gentner & Markman, 1997; Jones & Love, 2007; Kokinov & French, 2003; Krawczyk, Holyoak, & Hummel, 2005; Markman & Gentner, 1993; Sagi et al., 2012; Thibaut, French, & Vezneva, 2010).",
      "source": 12
    },
    "theory_instantiated": 0,
    "affected_task": 2
  },
  {
    "uid": 9,
    "relevant_concept": 35,
    "principle_almost_instantiated": 10,
    "evidence": {
      "text": "Users can choose between alignments of the entire abstract (which are called aspects) but these is still a single alignment within that aspect, even though the user can change the rendering of that alignment by choosing different horizontal justification settings. Custom aspects allows users to define their own alignments of abstracts, but only if they come up with it themselves; the system does not assist them in seeing multiple possible alignments.",
      "source": 13
    }
  },
  {
    "uid": 10,
    "constructed_artifact": "AI Highlighters complementing AI Summaries",
    "principles": [
      10
    ],
    "description": "This system performs automatic highlighting (according to 4 pre-defined dimensions) on the variation present in documents but not captured in the AI summary, enabling users to notice variation across those 4 dimensions. Although this is not a Structure-Mapping Engine, the system invites users to assume or look for relationships between all text highlighted in the same color. However, there might be important relationships that are only shared among a subset of texts with the same color, or across texts that do not have the same color or any color assigned at all. Therefore, the support for seeing the 4 aspects may interfere with users perceiving relationships (i.e., information) pertaining to topics beyond the 4th dimension."
  }
]