observations = [
  {
    "uid": 0,
    "summary_observation": {
      "quote": "We discuss how analogical processes interact with the child's changing knowledge base to predict the course of learning, from conservative to domain-general understanding.",
      "source": 0,
      "theory": 0
    }
  },
  {
    "uid": 1,
    "summary_observation": {
      "quote": "It shows that ... it is not enough to consider the distribution of examples given to learners; one must consider the processes learners are applying;",
      "source": 0,
      "theory": 0
    }
  },
  {
    "uid": 2,
    "summary_observation": {
      "quote": "It shows that ... contrary to the general assumption, maximizing variability is not always the best route for maximizing generalization and transfer.",
      "source": 0,
      "theory": 0
    }
  },
  {
    "uid": 3,
    "quote": "Reasoning processes require stable representations of constraints.",
    "source": 1
  },
  {
    "uid": 4,
    "quote": "the association of conceptual structure with material structure can stabilize conceptual representations. This is an old and pervasive cognitive strategy.",
    "context": "'There are two principal ways to achieve stability in conceptual models.' The second is the quoted one. The other is: 'the conceptual models that anthropologists call cultural models [which] achieve representational stability via a combination of intrapersonal and interpersonal processes.'",
    "source": 1
  },
  {
    "uid": 5,
    "quote": "'the association of conceptual structure with material structure' [is] 'a general and ancient human cognitive phenomenon.'",
    "context": "swapped phrase order of sentence"
  },
  "source": 1
},
{
  "uid": 6,
  "quote": "Thinking processes sometimes involve complex manipulations of conceptual structure. Conceptual structure must be represented in a way that allows some parts of the representation to be manipulated, while other parts remain stable. The complexity of the manipulations of structure can be increased if the stability of the representations can be increased. The stability of the representations is a necessary feature of the reasoning process, but it is often taken for granted. The need for representational stability becomes more visible in circumstances where the necessary stability is not present.",
  "note": "could be broken into multiple related observations",
  "source": 1
},
{
  "uid": 7,
  "quote": "one [study] clearly showed the role of a cultural heritage of mental models in the abilities of individuals to reason correctly. D’Andrade (1989) considered a number of logical isomorphs consisting of a premise in the form of an ‘if-then’ statement followed by an observation and a set of potential conclusions. For example, a subject is shown a premise, ‘‘If x is true then y is true’’ and then an observation, ‘‘We know that y is not true’’. The subject is then asked what can be inferred about x from the observation that y is not true. The choices are: ‘‘[It is the case that x is true.’’ (invalid conclusion), ‘‘[We cannot know if x is true or not.’’ (invalid conclusion), and ‘‘[It is the case that x is not true.’’ (valid conclusion). Only a small minority (about 15%) of subjects choose the correct conclusion. This example illustrates an abstract premise. From D’Andrade’s perspective, what is important about the premise in this problem is that, for most subjects, it is not culturally coherent. That is, unless x and y are associated with particular known concepts, our culture has nothing in particular to say about the relationship between x and y. Contrast this with a culturally coherent isomorph: Given the premise, ‘‘If this is a garnet, then it is a semi-precious stone’’ and the observation, ‘‘This is not a semi-precious stone’’, most subjects correctly reject the conclusions ‘‘[This is a garnet.’’ (invalid conclusion) and ‘‘[We can’t know if this is a garnet or not.’’ (invalid conclusion), preferring the correct conclusion ‘‘[This is not a garnet.’’ Formally the two problems are identical. A formal reasoning system that can solve one correctly should be able to solve the other correctly. In a series of experiments, D’Andrade showed that university students can draw correct logical inferences when such problems are expressed in terms of culturally coherent mental schemas. D’Andrade hypothesized that the ability to reason correctly with culturally coherent materials is due to the stability of the representation of the premises. Performing the modus tollens inference (If x then y; not x, therefore not y), as illustrated in the two examples above requires the subject to make two shifts in perspective. First from the ‘x’ case to the ‘y’ case, and then from the ‘y’ case to the ‘not y’ case.2 It appears that premises that lack cultural coherence cannot be held stably in memory while the transformations required to make the inferences are performed. D’Andrade’s study indicates that one way to establish the stability of representation to facilitate reasoning is to express the problems in terms offamiliar cultural models. Because they are shared, cultural models tend to be supported and reinforced by the behavior and thinking of others. Cultural models are also systematic in the sense that they exist in a complex nexus of models that mutually constrain one another. Most cultural models are closely related to many other models. This inter-linking contributes to the conservatism of cultural beliefs over time and to the stability of cultural models as resources for individual and group reasoning processes.",
  "source": 1,
  "artifacts_that_may_be_explained": 1
},
{
  "uid": 8,
  "quote": "D’Andrade’s study indicates that one way to establish the stability of representation to facilitate reasoning is to express the problems in terms offamiliar cultural models.",
  "source": 1
},
{
  "uid": 9,
  "quote": "D’Andrade’s study indicates that one way to establish the stability of representation to facilitate reasoning is to express the problems in terms offamiliar cultural models.",
  "source": 1
},
{
  "uid": 10,
  "quote": "Cultural models are not only ideas that reside inside minds, they are often also embodied in material artifacts.",
  "source": 1,
  "artifacts_that_may_be_explained": 1
},
{
  "uid": 11,
  "hypothesized_connection": "PDC is a substrate for reading and possibly interacting with document content and structure.",
  "artifacts_that_may_be_explained": [
    0,
    1,
    4
  ]
}
]