theories = [
  {
    "uid": 0,
    "theory_name": "Structural Mapping Theory",
    "alternative_names": [
      "Structural Alignment Theory"
    ],
    "hypothesis": [
      {
        "quote": "We propose that analogical generalization drives much of this early learning and allows children [and adults] to generate new abstractions from experience.",
        "source": 0
      }
    ],
    "short_theory_descriptions": [
      {
        "text": "Describes the characteristics of the process by which people compare objects, attend to similarities and differences, form schema, etc. [see Analogy and Abstraction to fill out this list",
        "source": "Elena"
      },
      {
        "text": "A description of human's analogical generalization, supported by evidence collected from both children and adults.",
        "source": "0"
      },
      {
        "quote": "close comparisons potentiate more distant, purely relational comparisons through progressive alignment.",
        "source": 4,
        "concepts_referenced": [
          12,
          13
        ]
      },
      {
        "quote": "Comparison involves a process of structural alignment and mapping that leads to learning via abstraction, rerepresentation, inference-projection, and difference detection.",
        "source": 4,
        "concepts_referenced": [
          1,
          12,
          14,
          15,
          16,
          17,
          18
        ]
      },
      {
        "quote": "According to structure-mapping theory (Gentner, 1983), human comparison involves a process of establishing a structural alignment between two represented situations and then projecting inferences. The commonalities and differences between two situations are found by determining the maximal structurally consistent alignment between the representations of the two situations (Falkenhainer et al., 1989; Gentner & Markman, 1997; Markman & Gentner, 1993a; Medin, Goldstone, & Gentner, 1993).",
        "source": 4,
        "concepts_referenced": [
          1,
          12,
          14,
          17,
          18
        ],
        "early_key_papers": [
          5,
          6,
          7,
          8
        ]
      },
      {
        "quote": "The mapping process is operationalized in the Structure Mapping Engine (SME; Falkenhainer et al., 1989; Forbus, Gentner, & Law, 1995).",
        "source": 4,
        "concepts_referenced": [
          0,
          15
        ],
        "early_key_papers": [
          9,
          10
        ],
      },
      {
        "quote": "SME operates in a local-to-global fashion (see Fig. 1 <Caption: Overview of SME (the Structure-mapping Engine) showing how an initially blind, local-to-global process produces structurally consistent inferences.>). It begins with a local, structurally blind free-forall: All possible matches between individual elements of the two representations are found (resulting in many inconsistencies). In stage 2, these matches are combined into several structurally consistent clusters (kernels); finally, in stage 3, some of the kernels (a structurally consistent set) are combined into an overall mapping, with the largest and most deeply connected kernels being favored in the merge process (again, the systematicity principle). The resulting alignment consists of an explicit set of correspondences between the elements of the two representations.",
        "source": 4,
        "concepts_referenced": [
          0,
          1,
          14,
          15
        ],
        "figures": "4-1.png"
      },
      {
        "quote": "As a natural outcome of the alignment process, candidate inferences are projected from the base to the target. These inferences are propositions connected to the common system in one analog, but not yet present in the other.",
        "source": 4,
        "concepts_referenced": [
          14,
          17
        ]
      }
    ],
    "purposes_in_source_field": [
      {
        "purposes": [
          "Answer a 'central question' in human development': 'how young children gain knowledge so fast'",
          "characterize 'analogical generalization in both children and adults'"
        ],
        "source": 0
      }
    ],
    "key_summative_sources": [
      0
    ],
    "key_authors": [
      "Gentner"
    ],
    "source_field": "Psychology",
    "relevant_tasks": [
      0,
      1,
      2,
      3,
      4,
      5
    ],
    "relevant_quotes": [
      {
        "quote": "abstract knowledge are variously referred to as schemas, rules, abstractions, principles, or overhypotheses. Many such abstractions are expressed as relational categories—categories like evidence, counterfactual, and proportion, and on a more mundane level, bargain, ally, and rescue.",
        "source": 0
      }
    ]
  },
  {
    "uid": 1,
    "theory_name": "Conceptual blending theory",
    "alternative_names": "framework of conceptual blending",
    "short_theory_descriptions": [
      {
        "quote": "a useful framework for considering the joint contributions and mutual constraints of mental and material structure. Projecting material structure into a blended space can stabilize the conceptual blend.",
        "source": 1
      },
      {
        "quote": "A conceptual blend operates in two input mental spaces to yield a third space, the blend. Partial structure from the input spaces is projected into the blended space, which has emergent structure of its own. The emergent structure arises in three interrelated ways: Composition: Taken together, the projections from the inputs make new relations available that did not exist in the separate inputs. Completion: Knowledge of background frames, cognitive and cultural models, allows the composite structure projected into the blend from the inputs to beviewed as part of a largerself-contained structure in the blend. The pattern in the blend triggered by the inherited structures is ‘completed’ into the larger, emergent structure. Elaboration: The structure in the blend can then be elaborated. This is called ‘running the blend.’ It consists of cognitive work performed within the blend, according to its own emergent logic.",
        "source": 2,
        "pages": "150-151"
      },
      {
        "quote": "The theory of conceptual blending and mental spaces deals with abstract models of the kinds we usually think of as mental models.",
        "source": 1
      },
      {
        "quote": "Various elements of the input spaces are selectively mapped to the blended space. In the blended space, new inferences are possible. [relevant artifact: 2] In fact, some new inferences become automatic. [relevant artifact: 3]",
        "source": 1,
        "artifacts_that_may_be_explained": [
          2,
          3
        ]
      },
      {
        "quote": "In most treatments of conceptual integration, all input spaces are strictly mental constructs.",
        "source": 1
      }
    ],
    "key_summative_sources": 2
  },
  {
    "uid": 2,
    "theory_name": "Gestalt principles"
  },
  {
    "uid": 3,
    "theory_name": "Interaction substrates",
    "source_field": "HCI",
    "key_papers": [
      3
    ]
  }
]